2018/python-pickle.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>使用 pickle 序列化 Python 对象</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">使用 pickle 序列化 Python 对象</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf879db3">1. 前言</a></li>
<li><a href="#org80035f6">2. pickle 的简单使用</a></li>
<li><a href="#orgf749b28">3. 可序列化的对象</a></li>
<li><a href="#org70b107a">4. pickle 和 json</a></li>
<li><a href="#org5a06cb5">5. pickle 的使用技巧</a></li>
<li><a href="#org8a46811">6. 结语</a></li>
<li><a href="#orgf384313">7. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf879db3" class="outline-2">
<h2 id="orgf879db3"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
很久以前就接触过和 <code>pickle</code> 相关的内容了，但是因为存在 <code>json</code> 的原因，就没有专门去了解学习相关的内容。
</p>

<p>
而现在，因为和 <b>缓存</b> 相关的原因，使得我来了解学习一下 <code>pickle</code> 相关的内容。
</p>
</div>
</div>

<div id="outline-container-org80035f6" class="outline-2">
<h2 id="org80035f6"><span class="section-number-2">2</span> pickle 的简单使用</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>pickle</code> 模块的使用很简单，接口和 <code>json</code> 差不多，如果有 <code>json</code> 模块的使用经验，那么 <code>pickle</code> 模块的上手无疑会简单很多。
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> pickle

<span class="org-keyword">class</span> <span class="org-type">Example</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, value):
        <span class="org-keyword">self</span>.value = value

<span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">'data.dat'</span>, <span class="org-string">'wb'</span>) <span class="org-keyword">as</span> f:
    pickle.dump(Example(10), f)
</pre>
</div>

<p>
上面这段代码将一个 <code>Python</code> 对象序列化为一个字节流，并保存到文件 <code>data.dat</code>. 输出文件中的内容为：
</p>
<pre class="example">
b'\x80\x03c__main__\nExample\nq\x00)\x81q\x01}q\x02X\x05\x00\x00\x00valueq\x03K\nsb.'
</pre>

<p>
与之对应的，可以通过 <code>pickle.load</code> 函数从文件中读取字节流并反序列化还原为 <code>Python</code> 对象：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">'data.dat'</span>, <span class="org-string">'rb'</span>) <span class="org-keyword">as</span> f:
    <span class="org-variable-name">obj</span> = pickle.load(f)
    <span class="org-keyword">print</span>(<span class="org-string">'obj.value: '</span>, obj.value)
</pre>
</div>

<p>
输出结果为：
</p>
<pre class="example">
obj.value: 10
</pre>

<p>
另外，可以通过函数 <code>pickle.dumps</code> 可以将对象序列化为一个 <code>bytes</code> 对象，通过 <code>pickle.loads</code> 将一个 <code>bytes</code> 对象反序列化还原为 <code>Python</code> 对象：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">byte_data</span> = pickle.dumps(Example(233))
<span class="org-keyword">print</span>(<span class="org-string">'byte: '</span>, byte_data)

<span class="org-variable-name">obj</span> = pickle.loads(byte_data)
<span class="org-keyword">print</span>(<span class="org-string">'obj.value: '</span>, obj.value)
</pre>
</div>

<p>
输出结果如下：
</p>
<pre class="example">
byte:  b'\x80\x03c__main__\nExample\nq\x00)\x81q\x01}q\x02X\x05\x00\x00\x00valueq\x03K\xe9sb.'
obj.value:  233
</pre>
</div>
</div>

<div id="outline-container-orgf749b28" class="outline-2">
<h2 id="orgf749b28"><span class="section-number-2">3</span> 可序列化的对象</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>Python</code> 中，绝大多数对象都可以 <b>直接</b> 用 <code>pickle</code> 完成序列化，包括自定义的类，具体的规则如下：
</p>
<ul class="org-ul">
<li><code>None</code>, <code>True</code> 和 <code>False</code></li>
<li><code>int</code>, <code>float</code> 和 <code>complex</code></li>
<li><code>str</code>, <code>bytes</code> 和 <code>bytearrays</code></li>
<li>只包含可序列化对象的 <code>list</code>, <code>tuple</code>, <code>set</code> 和 <code>dict</code></li>
<li>在模块的顶层定义的函数，不包括 <code>lambda</code> 表达式</li>
<li>在模块的顶层定义的内置函数</li>
<li>在模块的顶层定义的类</li>
</ul>

<p>
遵循以上规则的对象是可以直接序列化的，需要注意的是，对于 <b>类实例</b>, 还存在一些特殊的规则。
</p>

<p>
和前面的代码一样， <b>类实例</b> 对象一般不需要额外的代码就可以完成序列化，其序列化行为类似如下代码：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">dump</span>(obj):
    <span class="org-keyword">return</span> (obj.__class__, obj.__dict__)

<span class="org-keyword">def</span> <span class="org-function-name">load</span>(cls, attributes):
    <span class="org-variable-name">obj</span> = cls.__new__(cls)
    obj.__dict__.update(attributes)
    <span class="org-keyword">return</span> obj
</pre>
</div>

<p>
可以看到，序列化 <b>类实例</b> 时会获取该实例的 <b>类</b> 和 <b>属性字典</b>, 反序列化时直接更新 <b>实例属性</b> 而不是调用 <code>__init__</code> 方法。
</p>

<p>
这一行为对于部分对象来说是不合适的，比如说：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> time
<span class="org-keyword">import</span> threading

<span class="org-keyword">class</span> <span class="org-type">Countdown</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, n):
        <span class="org-keyword">self</span>.n = n
        <span class="org-keyword">self</span>.thr = threading.Thread(target=<span class="org-keyword">self</span>.run)
        <span class="org-keyword">self</span>.thr.daemon = <span class="org-constant">True</span>
        <span class="org-keyword">self</span>.thr.start()

    <span class="org-keyword">def</span> <span class="org-function-name">run</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">while</span> <span class="org-keyword">self</span>.n &gt; 0:
            <span class="org-keyword">print</span>(<span class="org-string">'T-minus'</span>, <span class="org-keyword">self</span>.n)
            <span class="org-keyword">self</span>.n -= 1
            time.sleep(5)
</pre>
</div>

<p>
对于 <code>Countdown</code> 的实例，如果只是恢复自身的属性值是不够的，因为其状态还依赖于 <b>外部系统状态</b>. 对于这些对象，可以通过实现
<code>__getstate__</code> 和 <code>__setstate__</code> 方法来定义它们的序列化行为。
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Countdown</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, n):
        <span class="org-keyword">self</span>.n = n
        <span class="org-keyword">self</span>.thr = threading.Thread(target=<span class="org-keyword">self</span>.run)
        <span class="org-keyword">self</span>.thr.daemon = <span class="org-constant">True</span>
        <span class="org-keyword">self</span>.thr.start()

    <span class="org-keyword">def</span> <span class="org-function-name">run</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">while</span> <span class="org-keyword">self</span>.n &gt; 0:
            <span class="org-keyword">print</span>(<span class="org-string">'T-minus'</span>, <span class="org-keyword">self</span>.n)
            <span class="org-keyword">self</span>.n -= 1
            time.sleep(5)

    <span class="org-keyword">def</span> <span class="org-function-name">__getstate__</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.n

    <span class="org-keyword">def</span> <span class="org-function-name">__setstate__</span>(<span class="org-keyword">self</span>, n):
        <span class="org-keyword">self</span>.__init__(n)
</pre>
</div>

<p>
序列化时会调用 <code>__getstate__</code> 方法，反序列化时会调用 <code>__setstate__</code> 方法。
</p>
</div>
</div>

<div id="outline-container-org70b107a" class="outline-2">
<h2 id="org70b107a"><span class="section-number-2">4</span> pickle 和 json</h2>
<div class="outline-text-2" id="text-4">
<p>
大多数时候，序列化一个 <code>Python</code> 对象我会选择 <code>json</code> 模块来完成，因为 <code>json</code> 格式更通用，更易读。
</p>

<p>
但是， <code>pickle</code> 也具有其优势：
</p>
<ul class="org-ul">
<li>能够直接序列化大多数 <code>Python</code> 对象，方便</li>
<li>能够以更快的速度序列化 <code>Python</code> 对象，快速</li>
</ul>

<p>
这两点中，更吸引我的是 <code>pickle</code> 的 <b>方便</b>, 在不要求通用性和可读性的情况下， <code>pickle</code> 是一个很好的选择。
</p>

<p>
比如说，实现一个简单的内存缓存：
</p>

<ul class="org-ul">
<li><a href="https://github.com/pallets/werkzeug/blob/master/werkzeug/contrib/cache.py#L280">werkzeug.contrib.cache.SimpleCache</a></li>
</ul>

<p>
上面的链接是 <a href="https://github.com/pallets/werkzeug">werkzeug</a> 中 <code>SimpleCache</code> 的源码链接，它的实现就使用了 <code>pickle</code>, 部分代码如下：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">SimpleCache</span>(BaseCache):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, threshold=500, default_timeout=300):
        BaseCache.__init__(<span class="org-keyword">self</span>, default_timeout)
        <span class="org-keyword">self</span>._cache = {}
        <span class="org-keyword">self</span>.clear = <span class="org-keyword">self</span>._cache.clear
        <span class="org-keyword">self</span>._threshold = threshold

    <span class="org-keyword">def</span> <span class="org-function-name">get</span>(<span class="org-keyword">self</span>, key):
        <span class="org-keyword">try</span>:
            <span class="org-variable-name">expires</span>, <span class="org-variable-name">value</span> = <span class="org-keyword">self</span>._cache[key]
            <span class="org-keyword">if</span> expires == 0 <span class="org-keyword">or</span> expires &gt; time():
                <span class="org-keyword">return</span> pickle.loads(value)
        <span class="org-keyword">except</span> (<span class="org-type">KeyError</span>, pickle.PickleError):
            <span class="org-keyword">return</span> <span class="org-constant">None</span>

    <span class="org-keyword">def</span> <span class="org-function-name">set</span>(<span class="org-keyword">self</span>, key, value, timeout=<span class="org-constant">None</span>):
        <span class="org-variable-name">expires</span> = <span class="org-keyword">self</span>._normalize_timeout(timeout)
        <span class="org-keyword">self</span>._prune()
        <span class="org-keyword">self</span>._cache[key] = (expires, pickle.dumps(value,
                                                  pickle.HIGHEST_PROTOCOL))
        <span class="org-keyword">return</span> <span class="org-constant">True</span>
</pre>
</div>

<p>
对于速度，可以用简单的代码来测试一下：
</p>
<div class="org-src-container">
<pre class="src src-python">In [1]: <span class="org-keyword">import</span> json, pickle

In [2]: <span class="org-variable-name">obj</span> = <span class="org-builtin">list</span>({val: -val} <span class="org-keyword">for</span> val <span class="org-keyword">in</span> <span class="org-builtin">range</span>(1000000))

In [3]: %timeit <span class="org-variable-name">json_dump</span> = json.dumps(obj)
976 ms &#177; 43 ms per loop (mean &#177; std. dev. of 7 runs, 1 loop each)

In [4]: %timeit <span class="org-variable-name">pickle_dump</span> = pickle.dumps(obj)
436 ms &#177; 7.2 ms per loop (mean &#177; std. dev. of 7 runs, 1 loop each)
</pre>
</div>

<p>
很明显， <code>pickle</code> 的速度要快不少，所以，对于一些 <code>Python</code> 内部的使用场景， <code>pickle</code> 是一个不错的选择。
</p>
</div>
</div>

<div id="outline-container-org5a06cb5" class="outline-2">
<h2 id="org5a06cb5"><span class="section-number-2">5</span> pickle 的使用技巧</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><p>
<code>pickle</code> 可以很智能的处理多个对象：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-keyword">import</span> pickle
&gt;&gt;&gt; <span class="org-variable-name">f</span> = <span class="org-builtin">open</span>(<span class="org-string">'somedata'</span>, <span class="org-string">'wb'</span>)
&gt;&gt;&gt; pickle.dump([1, 2, 3, 4], f)
&gt;&gt;&gt; pickle.dump(<span class="org-string">'hello'</span>, f)
&gt;&gt;&gt; pickle.dump({<span class="org-string">'Apple'</span>, <span class="org-string">'Pear'</span>, <span class="org-string">'Banana'</span>}, f)
&gt;&gt;&gt; f.close()
&gt;&gt;&gt; <span class="org-variable-name">f</span> = <span class="org-builtin">open</span>(<span class="org-string">'somedata'</span>, <span class="org-string">'rb'</span>)
&gt;&gt;&gt; pickle.load(f)
[1, 2, 3, 4]
&gt;&gt;&gt; pickle.load(f)
<span class="org-string">'hello'</span>
&gt;&gt;&gt; pickle.load(f)
{<span class="org-string">'Apple'</span>, <span class="org-string">'Pear'</span>, <span class="org-string">'Banana'</span>}
</pre>
</div></li>
</ul>
<ul class="org-ul">
<li><p>
函数 <code>pickle.dump</code> 和 <code>pickle.dumps</code> 可以通过参数 <code>protocol</code> 来指定序列化方式，该参数的取值范围为 <code>[0, pickle.HIGHEST_PROTOCOL]</code>, 默认值为 <code>pickle.DEFAULT_PROTOCOL</code>.
</p>

<p>
效果如下：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-keyword">import</span> pickle
&gt;&gt;&gt; <span class="org-variable-name">obj</span> = <span class="org-builtin">list</span>(<span class="org-builtin">range</span>(1000000))
&gt;&gt;&gt; <span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">'dump_min.dat'</span>, <span class="org-string">'wb'</span>) <span class="org-keyword">as</span> f:
...     pickle.dump(obj, f, 0)
...
&gt;&gt;&gt; <span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">'dump_max.dat'</span>, <span class="org-string">'wb'</span>) <span class="org-keyword">as</span> f:
...     pickle.dump(obj, f, pickle.HIGHEST_PROTOCOL)
...
</pre>
</div>

<pre class="example">
$  du -h dump_min.dat
9.5M    dump_min.dat

$  du -h dump_max.dat
4.7M    dump_max.dat
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org8a46811" class="outline-2">
<h2 id="org8a46811"><span class="section-number-2">6</span> 结语</h2>
<div class="outline-text-2" id="text-6">
<p>
测试的时候想创建一个够大的列表，直接顺手按了一串零，结果，电脑当场死机&#x2026;&#x2026;
</p>

<p>
重启后算了一下，至少需要 <code>37G</code> 的内存来保存数据才够用 @_@
</p>

<p>
垃圾电脑 QAQ
</p>
</div>
</div>

<div id="outline-container-orgf384313" class="outline-2">
<h2 id="orgf384313"><span class="section-number-2">7</span> 参考链接</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://docs.python.org/3/library/pickle.html">pickle — Python object serialization</a></li>
<li><a href="https://python3-cookbook.readthedocs.io/zh_CN/latest/c05/p21_serializing_python_objects.html">序列化 Python 对象 - Python Cookbook</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
